posts/2021-11-28-emacs-journey/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Journey 2021</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">My Emacs Journey 2021</h1>
</header><p>
Another year, another Emacs report!
</p>

<div id="outline-container-cutting-back" class="outline-2">
<h2 id="cutting-back"><a href="#cutting-back">Cutting-Back</a></h2>
<div class="outline-text-2" id="text-cutting-back">
<p>
As some sort of experiment I have tried to reduce the amount of plugins and
custom code as much as possible to see if I can live without them. This gives me
an opportunity to find ways that work with either vanilla Emacs or with tools
that are already installed through plugin dependencies.
</p>
</div>
</div>

<div id="outline-container-one-transient-to-rule-them-all" class="outline-2">
<h2 id="one-transient-to-rule-them-all"><a href="#one-transient-to-rule-them-all">One Transient To Rule Them All</a></h2>
<div class="outline-text-2" id="text-one-transient-to-rule-them-all">
<p>
All of my custom keybindings are accessible using the <code>&lt;apps&gt;</code> or <code>&lt;menu&gt;</code> keys.
<code>&lt;f5&gt;</code> is used as a fallback for keyboards which don't have either of these
keys. The major change to last year is that I have switched from the hydra
package to transient, which is already installed if you are using magit. This
change reduced the overall packages I need to install while also making my
custom menus look really nice.
</p>
</div>
</div>

<div id="outline-container-goodbye-ivy" class="outline-2">
<h2 id="goodbye-ivy"><a href="#goodbye-ivy">Goodbye Ivy</a></h2>
<div class="outline-text-2" id="text-goodbye-ivy">
<p>
Ivy, counsel and swiper were some of my most used packages. They have some
quirks, but the overall feature set is just fantastic (thanks abo-abo!). Over
the last few months several people have tried to use some of the newer
completion frameworks, which made me curious. I'm now using a combination of
vertico, orderless, counsel and embark. While the number of packages has
increased, the overall amount of code was reduced. Out of all these packages,
embark is the one with the most unused potential in my setup. I miss ivy's
minibuffer actions and I haven't grokked embark enough to re-implement them.
</p>
</div>
</div>

<div id="outline-container-org-publish" class="outline-2">
<h2 id="org-publish"><a href="#org-publish">Org Publish</a></h2>
<div class="outline-text-2" id="text-org-publish">
<p>
I have tried (and failed) to rewrite this blog using <code>org-publish</code>. You can find
a dozen of tutorials on how people migrated their blog to org, but for some
reason I just can't get it to work the way I want. This frustration makes you
wonder if you should write your own static blog generator, but the world already
has enough of these custom generator projects.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2021-11-28</p>
<footer>
<p>© 2025 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
